IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2
ULS Check Shear Ec2

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Ved
shear force

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Vrdc
shear resistance of concrete

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Vrdr
shear resistance

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Vrdmax
shear resistance of compression strut

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Vrds
shear resistance of shear reinforcement

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2.Vrd
decisive shear resistance